Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Basic configuration:
it_it: Configurazione di base:

source: Basic fragment usage
it_it: Utilizzo di base dei frammenti

source: Basic glTF Viewer Creation
it_it: Creazione di Base del Visualizzatore glTF

source: Basic grid navigation
it_it: Grid navigation di base

source: Basic initialization:
it_it: Inizializzazione di base:

source: Basically, anyone who has access to the private repository can log in with a GitHub account and view the repository's content.
it_it: In pratica, chiunque abbia accesso al repository privato può accedere con un account GitHub e visualizzarne il contenuto.

source: Basically, every modern controller which is able to drive a display is suitable to run LVGL.
it_it: In pratica, qualsiasi controller moderno in grado di pilotare un display è adatto all'esecuzione di LVGL.

source: Batch Registration from a Folder
it_it: Registrazione Batch da una Cartella

source: Be advised: this also pauses handling of Timers that refresh Display(s) and read from input devices, so don't forget to re-enable it with :cpp:expr:`lv_timer_enable(true)` as soon as the need for the pause is over.
it_it: Attenzione: questo sospende anche la gestione dei Timer che aggiornano i Display e leggono dai dispositivi di input, quindi non dimenticare di riabilitarla con :cpp:expr:`lv_timer_enable(true)` on appena la necessità della pausa è terminata.

source: Be sure to add ninja/make to your PATH!
it_it: Aggiungere ninja/make al PATH!

source: Be sure to at least set :c:macro:`LV_COLOR_DEPTH` according to your display's color depth.
it_it: Si deve impostare almeno :c:macro:`LV_COLOR_DEPTH` in base alla profondità di colore del display.

source: Be sure to replicate the problem quickly otherwise the logs become too big
it_it: Assicurarsi di replicare il problema rapidamente, altrimenti i log diventano troppo grandi.

source: Be sure you are calling :cpp:expr:`lv_display_flush_ready(drv)` at the end of your "*display flush callback*" as per the :ref:`flush_callback` section.
it_it: Chiamare :cpp:expr:`lv_display_flush_ready(drv)` alla fine del proprio "*display flush callback*" come indicato nella sezione :ref:`flush_callback`.

source: Be sure you are calling :cpp:expr:`lv_tick_inc(x)` as prescribed in :ref:`tick_interface` and are calling :cpp:func:`lv_timer_handler` as prescribed in :ref:`timer_handler`.
it_it: Chiamare :cpp:expr:`lv_tick_inc(x)` come prescritto in :ref:`tick_interface` e chiamare :cpp:func:`lv_timer_handler` come stabilito in :ref:`timer_handler`.

source: Be sure you are using one of the methods for thread management as described in :ref:`threading`.
it_it: Utilizzare uno dei metodi per la gestione dei thread descritti in :ref:`threading`.

source: Be sure your display works without LVGL.
it_it: Assicurarsi che il display funzioni senza LVGL.

source: Because LVGL Editor exports projects with nested folders like:
it_it: Poiché LVGL Editor esporta progetti con cartelle nidificate come:

source: Because ``project_local.xml`` contains a personal token, it should be added to ``.gitignore`` and stored only locally.
it_it: Poiché ``project_local.xml`` contiene un token personale, dovrebbe essere aggiunto a ``.gitignore`` e memorizzato solo localmente.

source: Because embedded devices have limited (flash) storage, it is recommended to compress images.
it_it: Poiché i dispositivi embedded hanno una memoria limitata (flash), si consiglia di comprimere le immagini.

source: Because it's Eclipse-based, it runs on Windows, Linux, and Mac as well.
it_it: Essendo basato su Eclipse, funziona anche su Windows, Linux e Mac.

source: Because manually managing PR can be cumbersome and error-prone, an automated solution exists.
it_it: Poiché la gestione manuale delle PR può essere macchinosa e soggetta a errori, esiste una soluzione automatizzata.

source: Because not everyone has editors that deal with Unicode characters well, please reST substitutions to insert special characters into documentation.
it_it: Poiché non tutti dispongono di editor che gestiscono bene i caratteri Unicode, si prega di utilizzare le sostituzioni reST per inserire caratteri speciali nella documentazione.

source: Because of the former, an animation on a single :cpp:type:`lv_style_t` object shared among several objects can simultaneously modify the appearance of all objects that use it.
it_it: Per via del primo, un'animazione su un singolo oggetto :cpp:type:`lv_style_t` condiviso tra più oggetti può modificare simultaneamente l'aspetto di tutti gli oggetti che lo utilizzano.

source: Because of the search sequence in :cpp:expr:`lv_obj_property_get_id(widget, name)`, if a name does exist in both lists, then using this function forces the name in the Widget's class hierarchy properties to have precedence over the style name.
it_it: A causa della sequenza di ricerca in :cpp:expr:`lv_obj_property_get_id(widget, name)`, se un nome esiste in entrambi gli elenchi, l'utilizzo di questa funzione impone al nome nelle proprietà della gerarchia di classi del Widget di avere la precedenza sul nome dello stile.

source: Because of the way ``HAL_Delay`` works, a delay of ``1`` actually only delays for between 0 and 1 ms.
it_it: A causa del funzionamento di ``HAL_Delay``, un ritardo di ``1`` in realtà ritarda solo per un intervallo compreso tra 0 e 1 ms.

source: Because of this intermittent polling, there is a chance that some user events are missed.
it_it: A causa di questo polling intermittente, è possibile che alcuni eventi utente vengano persi.

source: Because of this timing, custom versions of these functions can be used according to the below, and they can even be used like "event hooks" to implement a trace operation that occurs when each Widget is created and deleted.
it_it: A causa di questa tempistica, è possibile utilizzare versioni personalizzate di queste funzioni come indicato di seguito e possono anche essere utilizzate come "event hook" per implementare un'operazione di "tracing" che si verifica quando ogni Widget viene creato ed eliminato.

source: Because of this, any buttons added after the last Label added will be "stacked" on the far right of the Header.
it_it: Per questo motivo, tutti i pulsanti aggiunti dopo l'ultima etichetta verranno "impilati" all'estrema destra dell'Header.

source: Because the actual names are "assembled" by a preprocessor string-concatenation macro and are thus hard to visualize, you can also find the names in the Widget's primary ``.c`` file in the ``properties[]`` array initializing the ``.id`` fields in the array.
it_it: Poiché i nomi effettivi vengono "assemblati" da una macro di concatenazione di stringhe del preprocessore e sono quindi difficili da visualizzare, è possibile trovare i nomi anche nel file ``.c`` primario del Widget, nell'array ``properties[]`` che inizializza i campi ``.id`` nell'array.

source: Because the whole image is not loaded, it cannot be zoomed or rotated.
it_it: Poiché l'immagine non è caricata per intero, non è possibile ingrandirla o ruotarla.

source: Before building the library, you may wish to edit `$(LVGL_ROOT)/env_support/qnx/lv_conf.h`, e.g. to add fonts or disable double-buffering.
it_it: Prima di creare la libreria, è consigliabile modificare `$(LVGL_ROOT)/env_support/qnx/lv_conf.h`, ad esempio per aggiungere font o disabilitare il doppio buffering.

source: Before every function prototype in ``.h`` files, include a Doxygen-formatted comment like this:
it_it: Prima di ogni prototipo di funzione nei file ``.h``, includere un commento formattato in Doxygen come questo:

source: Before manually initializing your display though, check to see if your project uses the LTDC (LCD-TFT Display Controller) peripheral.
it_it: Prima di inizializzare manualmente il display, verificare se il progetto utilizza la periferica LTDC (LCD-TFT Display Controller).

source: Before manually initializing your display, check to see if your project uses the LTDC (LCD-TFT Display Controller) peripheral.
it_it: Prima di inizializzare manualmente il display, verificare se il progetto utilizza la periferica LTDC (LCD-TFT Display Controller).

source: Before posting a question, please read this FAQ section since you might find the answer to your issue here as well.
it_it: Prima di postare una domanda, leggere questa sezione FAQ, poiché si potrebbe trovare la risposta al problema anche qui.

source: Before registering ``globals.xml``, :cpp:expr:`lv_xml_set_default_asset_path("path/prefix/")` can be called to set the parent folder.
it_it: Prima di registrare ``globals.xml``, è possibile richiamare :cpp:expr:`lv_xml_set_default_asset_path("path/prefix/")` per impostare la cartella padre.

source: Before the ``<styles>`` tag, the ``<gradients>`` tag can be used to describe various gradients, which can later be referenced in styles.
it_it: Prima del tag ``<styles>``, il tag ``<gradients>`` può essere utilizzato per descrivere diversi gradienti, a cui è possibile fare riferimento in seguito negli stili.

source: Before using a draw descriptor it needs to be initialized with the related function.
it_it: Prima di utilizzare un descrittore di disegno, è necessario inizializzarlo con la funzione correlata.

source: Before using a style it needs to be initialized with :cpp:expr:`lv_style_init(&style1)`.
it_it: Prima di utilizzare uno stile è necessario inizializzarlo con :cpp:expr:`lv_style_init(&style1)`.

source: Before using a style it should be initialized with :cpp:expr:`lv_style_init(&my_style)`.
it_it: Prima di utilizzare uno stile, è necessario inizializzarlo con :cpp:expr:`lv_style_init(&my_style)`.

source: Before using the Editor ``WSL`` (Windows Subsystem for Linux) needs to be installed.
it_it: Prima di utilizzare l'Editor, è necessario installare ``WSL`` (Windows Subsystem for Linux).

source: Before v8 the last minor release of each major series was supported for 1 year.
it_it: Prima della v8, l'ultima release minor di ogni serie principale era supportata per 1 anno.

source: Begin by installing TorizonOS by using the Toradex Easy Installer.
it_it: Si inizia installando TorizonOS utilizzando Toradex Easy Installer.

source: Being consistent about this helps the reST parser to format the tables of contents correctly.
it_it: Essere coerenti in questo aiuta il parser reST a formattare correttamente gli indici.

source: Being respectful of differing viewpoints and experiences
it_it: Essere rispettosi di diversi punti di vista ed esperienze

source: Below are several basic examples.
it_it: Di seguito sono riportati diversi esempi di base.

source: Below is a list of the available options/variables
it_it: Di seguito è riportato un elenco delle opzioni/variabili disponibili

source: Below is an example for rotating when the rendering mode is :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` and the image can be rotated directly into a **frame buffer of the LCD peripheral**.
it_it: Di seguito è riportato un esempio di rotazione quando la modalità di rendering è :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` e l'immagine può essere ruotata direttamente in un **frame buffer della periferica LCD**.

source: Below is an example for rotating when the rendering mode is :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` and the rotated image should be sent to a **display controller**.
it_it: Di seguito è riportato un esempio di rotazione quando la modalità di rendering è :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_PARTIAL` e l'immagine ruotata deve essere inviata a un **display controller**.

source: Below is an example showing how manually and automatically assigned names are resolved:
it_it: Di seguito è riportato un esempio che mostra come vengono risolti i nomi assegnati manualmente e automaticamente:

source: Below is how to map images with names.
it_it: Di seguito è illustrato come mappare le immagini con i nomi.

source: Benefits
it_it: Vantaggi

source: Berry has the following advantages:
it_it: Berry offre i seguenti vantaggi:

source: Berry offers a syntax very similar to Python, and is inspired from LUA VM. It is fully integrated in Tasmota
it_it: Berry offre una sintassi molto simile a Python e si ispira alla VM LUA. È completamente integrato in Tasmota.

source: Besides Components and Screens, Widgets are the other main building blocks of UIs.
it_it: Oltre a Componenti e Screen, i Widget sono gli altri elementi costitutivi principali delle interfacce utente.

source: Besides RGB888 and ARGB8888 color formats, the following formats are supported:
it_it: Oltre ai formati colore RGB888 e ARGB8888, sono supportati i seguenti formati:

source: Besides Widgets, events can be registered for displays and input devices as well.
it_it: Oltre ai widget, è possibile registrare eventi anche per display e dispositivi di input.

source: Besides binding properties to subjects, it's also possible to add events the change the value of a subject on pressed, release, etc.
it_it: Oltre a collegare le proprietà ai subject, è anche possibile aggiungere eventi che modificano il valore di un subject quando viene premuto, rilasciato, ecc.

source: Besides events, it's common to register images and fonts stored in the application code by :cpp:expr:`lv_xml_register_image(scope, "image_name", path_or_pointer)` and :cpp:expr:`lv_xml_register_font(scope, "font_name", path_or_pointer)`.
it_it: Oltre agli eventi, è comune registrare immagini e font memorizzati nel codice dell'applicazione tramite :cpp:expr:`lv_xml_register_image(scope, "image_name", path_or_pointer)` e :cpp:expr:`lv_xml_register_font(scope, "font_name", path_or_pointer)`.

source: Besides just setting the color and opacity of each stop, it is also possible to set where they start relative to the whole gradient area.
it_it: Oltre a impostare il colore e l'opacità di ogni stop, è anche possibile impostare il punto di inizio rispetto all'intera area del gradiente.

source: Besides settings the sizes in pixels, you can use two special values:
it_it: Oltre a impostare le dimensioni in pixel, è possibile utilizzare due valori speciali:

source: Besides supporting the creation and preview of components and screens, it also supports describing UI tests, animations, translations, and basically everything defined in XML.
it_it: Oltre a supportare la creazione e l'anteprima di componenti e schermate, supporta anche la descrizione di test dell'interfaccia utente, animazioni, traduzioni e praticamente tutto ciò che è definito in XML.

source: Besides the default value :c:macro:`LV_COLOR_FORMAT_ARGB8888`, other formats can be used as well.
it_it: Oltre al valore di default :c:macro:`LV_COLOR_FORMAT_ARGB8888`, è possibile utilizzare anche altri formati.

source: Besides the display controller, some ESP32 chips offer graphical hardware acceleration peripherals like:
it_it: Oltre al controller del display, alcuni chip ESP32 offrono periferiche di accelerazione hardware grafica come:

source: Besides the typical background properties, it uses text style properties to change the appearance of the text of the selected item.
it_it: Oltre alle tipiche proprietà di background, utilizza le proprietà di stile del testo per modificare l'aspetto del testo dell'elemento selezionato.

source: Besides these, any custom code and functions can be freely implemented in this file.
it_it: Oltre a queste, in questo file è possibile implementare liberamente codice e funzioni personalizzati.

source: Besides these, some conjunction rules should also be taken into account.
it_it: Oltre a queste, è necessario tenere conto anche di alcune regole di congiunzione.

source: Besides, managing "normal" scrolling there are many interesting and useful additional features.
it_it: Oltre alla gestione dello scorrimento "normale", ci sono molte funzionalità aggiuntive interessanti e utili.

source: Best Performance: UIs with static or infrequently changing content benefit most from texture caching
it_it: Prestazioni Ottimali: Le interfacce utente con contenuti statici o che cambiano raramente traggono i maggiori vantaggi dal caching delle texture.

source: BiDi support is enabled by setting :c:macro:`LV_USE_BIDI` to a non-zero value in ``lv_conf.h``.
it_it: Il supporto BiDi è abilitato impostando :c:macro:`LV_USE_BIDI` su un valore diverso da zero in ``lv_conf.h``.

source: Bidirectional Support
it_it: Supporto Bidirezionale

source: BinFont Loader
it_it: Loader BinFont

source: Binary fonts also support selecting a subset of characters:
it_it: I font binari supportano anche la selezione di un sottoinsieme di caratteri:

source: Binary fonts can either reference:
it_it: I font binari possono fare riferimento a:

source: Bind Widgets to Subjects to automatically match the Widget's value with the Subject (e.g. a Label's text or an Arc's value).
it_it: Esegue il bind dei Widget ai Subject per abbinare automaticamente il valore del Widget al Subject (ad esempio, il testo di un'Etichetta o il valore di un Arco).

source: Bind a slider's value to a label
it_it: Associare il valore di uno slider a un'etichetta

source: Binding Local Styles
it_it: Binding di Stili Locali

source: Binding Styles
it_it: Binding degli Stili

source: Binding to :ref:`MicroPython`
it_it: Binding di :ref:`MicroPython`

source: Bindings
it_it: Binding

source: BitBake also tries to execute any dependent tasks first.
it_it: BitBake tenta inoltre di eseguire prima eventuali attività dipendenti.

source: BitBake chooses the one selected by the distribution configuration.
it_it: BitBake sceglie quella selezionata dalla configurazione della distribuzione.

source: BitBake handles the parsing and execution of the data files.
it_it: BitBake gestisce l'analisi e l'esecuzione dei file di dati.

source: BitBake is the tool at the heart of the OpenEmbedded Build System and is responsible for parsing the Metadata, generating a list of tasks from it, and then executing those tasks.
it_it: BitBake è lo strumento al centro del sistema di compilazione OpenEmbedded ed è responsabile dell'analisi dei metadati, della generazione di un elenco di task da essi e della loro esecuzione.

source: BitBake knows how to combine multiple data sources together and refers to each data source as a layer.
it_it: BitBake sa come combinare più sorgenti di dati e fa riferimento a ciascuna sorgente dati come a un layer.

source: Bits-per-pixel: 1, 2, 4, or 8
it_it: Bit-per-pixel: 1, 2, 4, o 8

source: Blank lines within comments are desirable when they improve clarity and readability.
it_it: Le righe vuote all'interno dei commenti sono auspicabili quando migliorano la chiarezza e la leggibilità.

source: Blending layers (w/ same supported formats as blitting).
it_it: Fusione dei livelli (con gli stessi formati supportati per il blitting).

source: Blit source image (any format from ``_vglite_src_cf_supported()``) over destination (any format from ``_vglite_dest_cf_supported()``).
it_it: Eseguire il blit [Block Image Transfer] dell'immagine sorgente (qualsiasi formato da ``_vglite_src_cf_supported()``) sulla destinazione (qualsiasi formato da ``_vglite_dest_cf_supported()``).

source: Blit source image ARGB8888 over destination.
it_it: Blit [Block Image Transfer] dell'immagine sorgente ARGB8888 sulla destinazione.

source: Blit source image RGB565/ARGB888/XRGB8888 over destination.
it_it: Blit [Block Image Transfer] dell'immagine sorgente RGB565/ARGB888/XRGB8888 sulla destinazione.

source: Blits with width or height higher than this value will be done in multiple steps.
it_it: I blit [Block Image Transfer] con larghezza o altezza superiori a questo valore verranno eseguiti in più passaggi.

source: Bluetooth, GSM, Wi-Fi modules like Nordic NRF, Espressif ESP32 and Raspberry Pi Pico W
it_it: Moduli Bluetooth, GSM e Wi-Fi come Nordic NRF, Espressif ESP32 e Raspberry Pi Pico W

source: Blur Draw Descriptor
it_it: Descrittore Blur Draw

source: Blur an area on the canvas
it_it: Sfocare un'area sul canvas

source: Blur is defined by :cpp:type:`lv_draw_blur_dsc_t`, which includes:
it_it: Il "blur" [sfocatura] è definita da :cpp:type:`lv_draw_blur_dsc_t`, che include:

source: Board Name
it_it: Nome della Board

source: Board Parameters
it_it: Parametri della Board

source: Board Support
it_it: Supporto delle Board

source: Board setup
it_it: Configurazione della scheda

source: Boards
it_it: Board

source: Border
it_it: Border [bordatura]

source: Border Draw Descriptor
it_it: Descrittore di Disegno del Bordo

source: Border styles
it_it: Stili per i Bordi

source: Both 32-bit and 64-bit ARM architectures are supported.
it_it: Sono supportate sia le architetture ARM a 32 bit che quelle a 64 bit.

source: Both MicroPython and LVGL can be used on many embedded architectures.
it_it: Sia MicroPython che LVGL possono essere utilizzati su numerose architetture embedded.

source: Both RGB888 and ARGB888 work with :c:macro:`LV_COLOR_DEPTH` ``32``
it_it: Sia RGB888 che ARGB888 funzionano con :c:macro:`LV_COLOR_DEPTH` ``32``

source: Both ``lv_anim_set_path_cb`` and :cpp:type:`lv_anim_path_cb_t` receive :cpp:type:`lv_anim_t` as their first argument
it_it: Sia ``lv_anim_set_path_cb`` che :cpp:type:`lv_anim_path_cb_t` ricevono :cpp:type:`lv_anim_t` come primo argomento

source: Both ``old_style`` and ``new_style`` must not be ``NULL``.
it_it: Sia ``old_style`` che ``new_style`` non devono essere ``NULL``.

source: Both are heavily inspired by the CSS layouts with the same name.
it_it: Entrambi sono fortemente ispirati ai layout CSS con lo stesso nome.

source: Both are supported by adding special XML tags as children of Components or Widgets:
it_it: Entrambi sono supportati aggiungendo tag XML speciali come elementi figlio di Componenti o Widget:

source: Both buffer address and buffer stride must be aligned.
it_it: Sia l'indirizzo del buffer che il passo del buffer devono essere allineati.

source: Both can be:
it_it: Entrambi possono essere:

source: Both files are located in ``TFT_eSPI`` library's folder inside PlatformIO’s ``.pio/libdeps/<env>/TFT_eSPI/`` directory.
it_it: Entrambi i file si trovano nella cartella della libreria ``TFT_eSPI`` all'interno della directory ``.pio/libdeps/<env>/TFT_eSPI/`` di PlatformIO.

source: Both files are located in ``TFT_eSPI`` library's folder.
it_it: Entrambi i file si trovano nella cartella della libreria ``TFT_eSPI``.

source: Both of these directories can be overridden using environment variables.
it_it: Entrambe queste directory possono essere sovrascritte utilizzando variabili d'ambiente.

source: Both simulator mode and application mode:
it_it: Modalità simulatore e modalità applicazione:

source: Both tags support the following optional attributes:
it_it: Entrambi i tag supportano i seguenti attributi opzionali:

source: Both the e2 studio and VSCode plugins help create a new UI project integrated with the Renesas project; however, it's the user's responsibility to initialize the UI and create the screens.
it_it: Sia i plugin e2 studio che VSCode aiutano a creare un nuovo progetto di interfaccia utente integrato col progetto Renesas; tuttavia, è responsabilità dell'utente inizializzare l'interfaccia utente e creare gli screen.

source: Both the start and end values of the Bar can be set.
it_it: È possibile impostare sia il valore iniziale che quello finale della Bar.

source: Both the start and the end values are included in the range.
it_it: Sia il valore iniziale che quello finale sono inclusi nell'intervallo.

source: Both use cases are covered in detail in the :ref:`Integration <editor_integration>` section.
it_it: Entrambi i casi d'uso sono trattati in dettaglio nella sezione :ref:`Integrazione <editor_integration>`.

source: Both vertical and horizontal use the same logic.
it_it: Sia l'allineamento verticale che quello orizzontale utilizzano la stessa logica.

source: Bottom Layer
it_it: Layer Inferiore
